{
	"flateReaderClose": "--- Close closes the Reader and returns an error for any future read operation.\n--- It does not close the underlying io.Reader.",
	"flateReaderRead": "--- Read implements io.Reader, reading uncompressed bytes from its underlying Reader.",
	"flateReaderReset": "--- Reset clears the Reader's state and allows it to be reused again\n--- as a new Reader.",
	"flateReaderdecode": "--- decode decompresses bytes from r and leaves them in d.toRead.\n--- read specifies how to decode bytes into codes.\n--- litWidth is the width in bits of literal codes.",
	"flateReaderinit": "",
	"flateReaderreadLSB": "--- readLSB returns the next code for \"Least Significant Bits first\" data.",
	"flateReaderreadMSB": "--- readMSB returns the next code for \"Most Significant Bits first\" data.",
	"flateWriterClose": "--- Close closes the Writer, flushing any pending output. It does not close\n--- w's underlying writer.",
	"flateWriterReset": "--- Reset clears the Writer's state and allows it to be reused again\n--- as a new Writer.",
	"flateWriterWrite": "--- Write writes a compressed representation of p to w's underlying writer.",
	"flateWriterincHi": "--- incHi increments e.hi and checks for both overflow and running out of\n--- unused codes. In the latter case, incHi sends a clear code, resets the\n--- writer state and returns errOutOfCodes.",
	"flateWriterinit": "",
	"flateWriterwriteLSB": "--- writeLSB writes the code c for \"Least Significant Bits first\" data.",
	"flateWriterwriteMSB": "--- writeMSB writes the code c for \"Most Significant Bits first\" data.",
	"lzwNewReader": "--- NewReader creates a new io.ReadCloser.\n--- Reads from the returned io.ReadCloser read and decompress data from r.\n--- If r does not also implement io.ByteReader,\n--- the decompressor may read more data than necessary from r.\n--- It is the caller's responsibility to call Close on the ReadCloser when\n--- finished reading.\n--- The number of bits to use for literal codes, litWidth, must be in the\n--- range [2,8] and is typically 8. It must equal the litWidth\n--- used during compression.\n---\n--- It is guaranteed that the underlying type of the returned io.ReadCloser\n--- is a *Reader.",
	"lzwNewWriter": "--- NewWriter creates a new io.WriteCloser.\n--- Writes to the returned io.WriteCloser are compressed and written to w.\n--- It is the caller's responsibility to call Close on the WriteCloser when\n--- finished writing.\n--- The number of bits to use for literal codes, litWidth, must be in the\n--- range [2,8] and is typically 8. Input bytes must be less than 1\u003c\u003clitWidth.\n---\n--- It is guaranteed that the underlying type of the returned io.WriteCloser\n--- is a *Writer."
}