{
	"flateWriterClose": "--- Close closes the Writer, flushing any unwritten data to the underlying\n--- io.Writer, but does not close the underlying io.Writer.",
	"flateWriterFlush": "--- Flush flushes the Writer to its underlying io.Writer.",
	"flateWriterReset": "--- Reset clears the state of the Writer z such that it is equivalent to its\n--- initial state from NewWriterLevel or NewWriterLevelDict, but instead writing\n--- to w.",
	"flateWriterWrite": "--- Write writes a compressed form of p to the underlying io.Writer. The\n--- compressed bytes are not necessarily flushed until the Writer is closed or\n--- explicitly flushed.",
	"flateWriterwriteHeader": "--- writeHeader writes the ZLIB header.",
	"zlibNewReader": "--- NewReader creates a new ReadCloser.\n--- Reads from the returned ReadCloser read and decompress data from r.\n--- If r does not implement io.ByteReader, the decompressor may read more\n--- data than necessary from r.\n--- It is the caller's responsibility to call Close on the ReadCloser when done.\n---\n--- The ReadCloser returned by NewReader also implements Resetter.",
	"zlibNewReaderDict": "--- NewReaderDict is like NewReader but uses a preset dictionary.\n--- NewReaderDict ignores the dictionary if the compressed data does not refer to it.\n--- If the compressed data refers to a different dictionary, NewReaderDict returns ErrDictionary.\n---\n--- The ReadCloser returned by NewReaderDict also implements Resetter.",
	"zlibNewWriter": "--- NewWriter creates a new Writer.\n--- Writes to the returned Writer are compressed and written to w.\n---\n--- It is the caller's responsibility to call Close on the Writer when done.\n--- Writes may be buffered and not flushed until Close.",
	"zlibNewWriterLevel": "--- NewWriterLevel is like NewWriter but specifies the compression level instead\n--- of assuming DefaultCompression.\n---\n--- The compression level can be DefaultCompression, NoCompression, HuffmanOnly\n--- or any integer value between BestSpeed and BestCompression inclusive.\n--- The error returned will be nil if the level is valid.",
	"zlibNewWriterLevelDict": "--- NewWriterLevelDict is like NewWriterLevel but specifies a dictionary to\n--- compress with.\n---\n--- The dictionary may be nil. If not, its contents should not be modified until\n--- the Writer is closed."
}